# Chapter 7: Data Cleaning and Preparation

# 7.1 Handling Missing Data

In [3]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [13]:
cleaned = data.dropna()

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
 data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))

In [21]:
df.iloc[:4, 1] = NA

In [22]:
df.iloc[:2, 2] = NA

In [23]:
df

          0         1         2
0  1.419204       NaN       NaN
1  1.141311       NaN       NaN
2 -1.449153       NaN -0.002334
3  0.177739       NaN -1.495944
4 -1.467525 -0.838811 -3.094421
5  0.175004 -0.138704  1.455232
6 -0.455622  1.401539  0.024699

In [24]:
df.dropna()

          0         1         2
4 -1.467525 -0.838811 -3.094421
5  0.175004 -0.138704  1.455232
6 -0.455622  1.401539  0.024699

In [25]:
df.dropna(thresh=2)

          0         1         2
2 -1.449153       NaN -0.002334
3  0.177739       NaN -1.495944
4 -1.467525 -0.838811 -3.094421
5  0.175004 -0.138704  1.455232
6 -0.455622  1.401539  0.024699

In [26]:
df.fillna(0)

          0         1         2
0  1.419204  0.000000  0.000000
1  1.141311  0.000000  0.000000
2 -1.449153  0.000000 -0.002334
3  0.177739  0.000000 -1.495944
4 -1.467525 -0.838811 -3.094421
5  0.175004 -0.138704  1.455232
6 -0.455622  1.401539  0.024699

In [27]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.419204  0.500000  0.000000
1  1.141311  0.500000  0.000000
2 -1.449153  0.500000 -0.002334
3  0.177739  0.500000 -1.495944
4 -1.467525 -0.838811 -3.094421
5  0.175004 -0.138704  1.455232
6 -0.455622  1.401539  0.024699

In [28]:
_ = df.fillna(0, inplace=True)

In [29]:
df

          0         1         2
0  1.419204  0.000000  0.000000
1  1.141311  0.000000  0.000000
2 -1.449153  0.000000 -0.002334
3  0.177739  0.000000 -1.495944
4 -1.467525 -0.838811 -3.094421
5  0.175004 -0.138704  1.455232
6 -0.455622  1.401539  0.024699

In [30]:
df = pd.DataFrame(np.random.randn(6, 3))

In [31]:
df.iloc[2:, 1] = NA

In [32]:
df.iloc[4:, 2] = NA

In [33]:
df

          0         1         2
0  0.170488 -0.312251  1.152616
1 -1.619607 -0.841090  0.457582
2  2.529864       NaN -0.260103
3 -0.561000       NaN -0.279874
4 -1.225716       NaN       NaN
5 -0.510431       NaN       NaN

In [34]:
df.fillna(method='ffill')

          0         1         2
0  0.170488 -0.312251  1.152616
1 -1.619607 -0.841090  0.457582
2  2.529864 -0.841090 -0.260103
3 -0.561000 -0.841090 -0.279874
4 -1.225716 -0.841090 -0.279874
5 -0.510431 -0.841090 -0.279874

In [35]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.170488 -0.312251  1.152616
1 -1.619607 -0.841090  0.457582
2  2.529864 -0.841090 -0.260103
3 -0.561000 -0.841090 -0.279874
4 -1.225716       NaN -0.279874
5 -0.510431       NaN -0.279874

In [36]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [37]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation

In [38]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [39]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data['v1'] = range(7)

In [43]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [44]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [45]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [46]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [47]:
meat_to_animal = { 'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'
}

In [48]:
lowercased = data['food'].str.lower()

In [49]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [51]:
data['animal'] = lowercased.map(meat_to_animal)

In [52]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [53]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [54]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [55]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [57]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [58]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [60]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [61]:
transform = lambda x: x[:4].upper()

In [62]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [63]:
data.index = data.index.map(transform)

In [64]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [65]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [66]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [67]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [68]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [69]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [70]:
bins = [18, 25, 35, 60, 100]

In [71]:
cats = pd.cut(ages, bins)

In [72]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [73]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [74]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [75]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [76]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [77]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [78]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [79]:
data = np.random.rand(20)

In [80]:
pd.cut(data, 4, precision=2)

[(0.32, 0.54], (0.32, 0.54], (0.54, 0.76], (0.095, 0.32], (0.32, 0.54], ..., (0.54, 0.76], (0.76, 0.99], (0.32, 0.54], (0.095, 0.32], (0.095, 0.32]]
Length: 20
Categories (4, interval[float64]): [(0.095, 0.32] < (0.32, 0.54] < (0.54, 0.76] < (0.76, 0.99]]

In [81]:
data = np.random.randn(1000) # Normally distributed

In [82]:
cats = pd.qcut(data, 4) # Cut into quartiles

In [83]:
cats

[(0.0119, 0.653], (0.653, 3.077], (0.0119, 0.653], (-2.8449999999999998, -0.615], (0.0119, 0.653], ..., (-2.8449999999999998, -0.615], (0.0119, 0.653], (0.0119, 0.653], (-2.8449999999999998, -0.615], (-2.8449999999999998, -0.615]]
Length: 1000
Categories (4, interval[float64]): [(-2.8449999999999998, -0.615] < (-0.615, 0.0119] < (0.0119, 0.653] < (0.653, 3.077]]

In [84]:
pd.value_counts(cats)

(0.653, 3.077]                   250
(0.0119, 0.653]                  250
(-0.615, 0.0119]                 250
(-2.8449999999999998, -0.615]    250
dtype: int64

In [85]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0119, 1.374], (1.374, 3.077], (0.0119, 1.374], (-2.8449999999999998, -1.208], (0.0119, 1.374], ..., (-2.8449999999999998, -1.208], (0.0119, 1.374], (0.0119, 1.374], (-2.8449999999999998, -1.208], (-1.208, 0.0119]]
Length: 1000
Categories (4, interval[float64]): [(-2.8449999999999998, -1.208] < (-1.208, 0.0119] < (0.0119, 1.374] < (1.374, 3.077]]

In [86]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [87]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.018667    -0.009068     0.027870    -0.017987
std       0.956526     0.994790     0.978014     1.008652
min      -2.614801    -3.308203    -2.918148    -3.163513
25%      -0.597424    -0.709415    -0.629445    -0.709050
50%       0.018797    -0.020837     0.016506    -0.019610
75%       0.691743     0.673816     0.677959     0.667257
max       3.134020     2.951419     3.724181     3.150101

In [88]:
col = data[2]

In [89]:
col[np.abs(col) > 3]

368    3.724181
637    3.065616
669    3.586615
Name: 2, dtype: float64

In [90]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
149  1.118899 -3.122589  1.392060 -0.017646
173 -0.330261 -0.606844 -0.288772  3.104864
368 -0.377697  0.067884  3.724181  2.326260
497  0.370968 -0.052746  0.318565  3.035510
547  3.134020 -0.511901 -0.993846  0.054059
563  0.235658 -3.308203 -0.273761 -0.136963
637  0.810855 -0.064751  3.065616  0.243032
669  0.551106 -1.468860  3.586615 -0.567121
805 -0.305804  1.106094  0.065973 -3.163513
878  0.354238  0.648092 -0.735944  3.150101

In [91]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [92]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.018533    -0.008638     0.026493    -0.018114
std       0.956098     0.993437     0.973368     1.007266
min      -2.614801    -3.000000    -2.918148    -3.000000
25%      -0.597424    -0.709415    -0.629445    -0.709050
50%       0.018797    -0.020837     0.016506    -0.019610
75%       0.691743     0.673816     0.677959     0.667257
max       3.000000     2.951419     3.000000     3.000000

In [93]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0  1.0 -1.0  1.0
2 -1.0  1.0  1.0 -1.0
3  1.0 -1.0  1.0  1.0
4  1.0  1.0 -1.0 -1.0

In [94]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [95]:
sampler = np.random.permutation(5)

In [96]:
sampler

array([3, 0, 1, 2, 4])

In [97]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [98]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19

In [99]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19

In [101]:
choices = pd.Series([5, 7, -1, 6, 4])

In [102]:
draws = choices.sample(n=10, replace=True)

In [103]:
draws

4    4
1    7
2   -1
1    7
3    6
4    4
4    4
3    6
2   -1
1    7
dtype: int64

In [104]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [105]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [106]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [107]:
df_with_dummy = df[['data1']].join(dummies)

In [108]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [1]:
mnames = ['movie_id', 'title', 'genres']

In [4]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)

<ipython-input-4-20ac69f290b4>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep='::',

In [5]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [6]:
all_genres = []

In [7]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [8]:
genres = pd.unique(all_genres)

In [9]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [10]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [11]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [12]:
gen = movies.genres[0]

In [13]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [14]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [17]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|')) 
    dummies.iloc[i, indices] = 1

In [18]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [19]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [113]:
np.random.seed(12345)

In [114]:
values = np.random.rand(10)

In [115]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [116]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [117]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 7.3 String Manipulation

In [118]:
val = 'a,b, guido'

In [119]:
val.split(',')

['a', 'b', ' guido']

In [120]:
pieces = [x.strip() for x in val.split(',')]

In [121]:
pieces

['a', 'b', 'guido']

In [122]:
first, second, third = pieces

In [124]:
first + '::' + second + '::' + third

'a::b::guido'

In [125]:
'::'.join(pieces)

'a::b::guido'

In [126]:
'guido' in val

True

In [127]:
val.index(',')

1

In [128]:
val.find(':')

-1

In [129]:
val.index(':')

ValueError: substring not found

In [130]:
val.count(',')

2

In [131]:
val.replace(',', '::')

'a::b:: guido'

In [132]:
val.replace(',', '')

'ab guido'

In [133]:
import re

In [134]:
text = "foo bar\t baz \tqux"

In [135]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [136]:
regex = re.compile('\s+')

In [137]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [138]:
regex.findall(text)

[' ', '\t ', ' \t']

In [139]:
text = """Dave dave@google.com Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [140]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [141]:
m = regex.search(text)

In [142]:
m

In [143]:
text[m.start():m.end()]

'dave@google.com'

In [144]:
print(regex.match(text))

None

In [145]:
print(regex.sub('REDACTED', text))

Dave REDACTED Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [146]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [147]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [148]:
m = regex.match('wesm@bright.net')

In [149]:
m.groups()

('wesm', 'bright', 'net')

In [150]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [153]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [154]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [155]:
data = pd.Series(data)

In [156]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [157]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [158]:
 data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [159]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [160]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [161]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [162]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [163]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [164]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [166]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object